app/controllers/users_controller.rb

INSERT INTO "users" ("age", "avatar", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["age", 2], ["avatar", "059b78a00e1e012f275d003018ae0aa6"], ["created_at", Wed, 21 Dec 2011 16:23:21 UTC +00:00], ["name", "Джи Пи"], ["updated_at", Wed, 21 Dec 2011 16:23:21 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "16"]]
UPDATE "users" SET "avatar" = '37d309600e45012f7243003018ae0aa6', "updated_at" = '2011-12-21 21:03:55.751272' WHERE "users"."id" = 16
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def destroy
    @user = User.find(params[:id])
    #puts "about to delete user"
    #pp @user.avatar
    @user.destroy